from random import randint

# Запросили у пользователя ввод n(размер массива)
print("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")
n = int(input("ВВЕДИТЕ РАЗМЕР МАССИВА(ОТ 5 ДО 30): "))
if n < 5:
    print("значение меньше 5, размер массива будет равен 5")
    n = 5
elif n > 30:
    print("значение больше 30, размер будет равен 30")
    n = 30
print("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")
# Создали пустой массив
mas = []
# Заполнили пустой массив рандомными целыми числами от 10 до 100
for i in range(0, n):
    mas.append(randint(-2, 10))

print("массив: ", mas)
print("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")
maxn = max(mas)
print("максимальный элемент массива =", maxn)
print("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")
sum = 0
for i in mas:
    sum += i%maxn
print("СУММА ОСТАТКОВ ПОЛУЧАЕМЫХ ОТ ДЕЛЕНИЯ ЭЛЕМЕНТОВ МАССИВА НА МАКСИМАЛЬНЫЙ ЭЛЕМЕНТ =", sum)
print("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")
# вариант сортировки пузыырьком
# for i in range(len(mas)): 
#     for i in range(1,len(mas)):
#         if mas[i] % maxn < mas[i-1] % maxn:
#             buf = mas[i]
#             mas[i] = mas[i-1]
#             mas[i-1] = buf
print(sorted(mas, key=lambda x:x%maxn))
print("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")
